In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.naive_bayes import GaussianNB
from module_emre import module_emre as mer

### NOT: SibSp ve Parch kolonlarından en az birinde bile 1 yazıyorsa, alone=1; her ikisi de sıfır ise alone=0 olacak yeşkilde "alone" kolonu ekleyelim.

In [39]:
df = pd.read_csv("SOURCES/titanic_train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [40]:
df["Alone"] = df["SibSp"] + df["Parch"]
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [33]:
df["Alone"].value_counts()

Alone
0     537
1     161
2     102
3      29
5      22
4      15
6      12
10      7
7       6
Name: count, dtype: int64

In [41]:
df_alone = df["Alone"]
for i in range(len(df_alone)):
    if df_alone[i] > 0:
        df.loc[i, "Alone"] = 1
    # print(i)
df_alone = df["Alone"]
df["Alone"].value_counts()

Alone
0    537
1    354
Name: count, dtype: int64

In [42]:
df.drop(["Cabin", "Ticket", "Name"] , axis=1, inplace=True)
df["Sex"].replace({"male": 0, "female": 1}, inplace=True)
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Alone
0,1,0,3,0,22.0,1,0,7.2500,S,1
1,2,1,1,1,38.0,1,0,71.2833,C,1
2,3,1,3,1,26.0,0,0,7.9250,S,0
3,4,1,1,1,35.0,1,0,53.1000,S,1
4,5,0,3,0,35.0,0,0,8.0500,S,0

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    int64
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Fare         891 non-null    float64
 8   Embarked     889 non-null    object
 9   Alone        891 non-null    int64
dtypes: float64(2), int64(7), object(1)
memory usage: 69.7+ KB

In [44]:
mean_ages = df["Age"].median()
df.fillna(mean_ages, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    int64
 4   Age          891 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Fare         891 non-null    float64
 8   Embarked     891 non-null    object
 9   Alone        891 non-null    int64
dtypes: float64(2), int64(7), object(1)
memory usage: 69.7+ KB

In [45]:
df_ages = df[["Age"]]
list_ages = list(df_ages["Age"])

df_pclass = df[["Pclass"]]
list_pclass = list(df_pclass["Pclass"])

df_sex = df[["Sex"]]
list_sex = list(df_sex["Sex"])

df_alone = df[["Alone"]]
list_alone = list(df_alone["Alone"])

df_survived = df[["Survived"]]
list_survived = list(df_survived["Survived"])

In [48]:
zipped_data = list(zip(list_pclass, list_ages, list_sex, list_alone))

my_list = []
for element in zipped_data:
    my_list.append(list(element))
    
X = np.array(my_list)
Y = np.array(list_survived)

In [63]:
# from mpl_toolkits.mplot3d import Axes3D

# fig = plt.figure()
# ax = fig.add_subplot(111, projection='3d')

# ax.scatter(X[:, 0], X[:, 1], X[:, 2], X[:, 3], c=Y, cmap='viridis')
# ax.set_xlabel('pclass')
# ax.set_ylabel('age')
# ax.set_zlabel('fare')
# ax.set_wlabel('4. Özellik')

# plt.show()

In [49]:
clf = GaussianNB()
clf.fit(X, Y)

GaussianNB()

In [50]:
df_test = pd.read_csv("SOURCES/titanic_test.csv")
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Alone
0,1,0,3,0,22.0,1,0,7.2500,S,1
1,2,1,1,1,38.0,1,0,71.2833,C,1
2,3,1,3,1,26.0,0,0,7.9250,S,0
3,4,1,1,1,35.0,1,0,53.1000,S,1
4,5,0,3,0,35.0,0,0,8.0500,S,0

In [51]:
df_test.drop(["Cabin", "Ticket", "Name"] , axis=1, inplace=True)

df_test["Alone"] = df_test["SibSp"] + df_test["Parch"]
df_alone = df_test["Alone"]
for i in range(len(df_alone)):
    if df_alone[i] > 0:
        df_test.loc[i, "Alone"] = 1
    # print(i)
df_alone = df["Alone"]

df_test["Sex"].replace({"male": 0, "female": 1}, inplace=True)
mean_ages = df_test["Age"].median()
df_test.fillna(mean_ages, inplace=True)
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Sex          418 non-null    int64
 3   Age          418 non-null    float64
 4   SibSp        418 non-null    int64
 5   Parch        418 non-null    int64
 6   Fare         418 non-null    float64
 7   Embarked     418 non-null    object
 8   Alone        418 non-null    int64
dtypes: float64(2), int64(6), object(1)
memory usage: 29.5+ KB

In [53]:
df_agesT = df_test[["Age"]]
list_agesT = list(df_agesT["Age"])

df_pclassT = df_test[["Pclass"]]
list_pclassT = list(df_pclassT["Pclass"])

df_sexT = df_test[["Sex"]]
list_sexT = list(df_sexT["Sex"])

df_aloneT = df_test[["Alone"]]
list_aloneT = list(df_aloneT["Alone"])

zipped_data = list(zip(list_pclassT, list_agesT, list_sexT, list_aloneT))

my_list = []
for element in zipped_data:
    my_list.append(list(element))
    
X_test = np.array(my_list)

In [54]:
result_train = clf.predict(X_test)

In [55]:
result_train

array([0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0,
       1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0,
       0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0,
       1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0])

In [56]:
x = df_test[["PassengerId"]].copy()
x.loc[:,"Survived"] = result_train
print("\n", x)

print("\nhayatta kalan kişi sayısı:", sum(x.Survived))

      PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

hayatta kalan kişi sayısı: 176

In [57]:
# x.to_csv("submission11.csv", index=False)